//******************************************************************************
// MIDIシーケンサーソフト『世界樹』
// クォンタイズダイアログクラス
// (C)2002-2017 おーぷんMIDIぷろじぇくと／くず
//******************************************************************************

/* This Source Code Form is subject to the terms of the Mozilla Public */
/* License, v. 2.0. If a copy of the MPL was not distributed with this */
/* file, You can obtain one at http://mozilla.org/MPL/2.0/. */

#ifndef _EDITQUANTIZEDLG_H_
#define _EDITQUANTIZEDLG_H_

class CEditQuantizeDlg : public CDialog {
	//--------------------------------------------------------------------------
	// アトリビュート
	//--------------------------------------------------------------------------
public:
	int m_lTimeMode;                    // タイムモード(0=TPQNベース, ...)
	int m_lTimeResolution;              // 分解能[tick/4分音符]又は[サブフレーム/1フレーム]
	int m_nSnapTimeIndex;               // スナップタイムインデックス(0=4分音符,1=8分音符...)
	int m_nStrength;                    // 強度[%]
	int m_nTargetNoteOn;                // ノートオンを対象とする(0/1)
	int m_nTargetNoteOff;               // ノートオフを対象とする(0/1)

	//--------------------------------------------------------------------------
	// 構築と破壊
	//--------------------------------------------------------------------------
public:
	CEditQuantizeDlg();                 // コンストラクタ
	enum {IDD = IDD_EDITQUANTIZE};

	//--------------------------------------------------------------------------
	// オペレーション
	//--------------------------------------------------------------------------
	BOOL SetAmountRange ();             // 強度の有効範囲を設定する
	BOOL FillSnapTimeCombo ();          // スナップタイムコンボボックスを充満させる


	//--------------------------------------------------------------------------
	// オーバーライド
	//--------------------------------------------------------------------------
protected:
	virtual void DoDataExchange (CDataExchange* pDX);    // DDX/DDV のサポート
	virtual BOOL OnInitDialog ();       // ダイアログの初期化

	//--------------------------------------------------------------------------
	// メッセージマップ
	//--------------------------------------------------------------------------
protected:
	DECLARE_MESSAGE_MAP ()
};

#endif
