//******************************************************************************
// MIDIシーケンサーソフト『世界樹』
// トラックリストボックスクラス
// (C)2002-2017 おーぷんMIDIぷろじぇくと／くず
//******************************************************************************

/* This Source Code Form is subject to the terms of the Mozilla Public */
/* License, v. 2.0. If a copy of the MPL was not distributed with this */
/* file, You can obtain one at http://mozilla.org/MPL/2.0/. */

#ifndef _TRACKLISTBOX_H_
#define _TRACKLISTBOX_H_

class CTrackListBox : public CColorfulCheckListBox {
	DECLARE_DYNCREATE (CTrackListBox)

	//--------------------------------------------------------------------------
	// アトリビュート
	//--------------------------------------------------------------------------
protected:
	CDocument* m_pDocument;             // ドキュメントへのポインタ
	long m_lMenuID;                     // 右クリックしたときに現れるメニューのID

	//--------------------------------------------------------------------------
	// 構築と破壊
	//--------------------------------------------------------------------------
public:
	CTrackListBox ();                   // コンストラクタ
	CTrackListBox (CDocument* pDocument, long lMenuID); // コンストラクタ
	virtual ~CTrackListBox ();          // デストラクタ

	//--------------------------------------------------------------------------
	// オペレーション
	//--------------------------------------------------------------------------
public:
	CSekaijuDoc* GetDocument ();

	//--------------------------------------------------------------------------
	// オーバーライド
	//--------------------------------------------------------------------------
protected:

	//--------------------------------------------------------------------------
	// メッセージマップ
	//--------------------------------------------------------------------------
protected:
	afx_msg void OnRButtonDown (UINT nFlags, CPoint point);
	DECLARE_MESSAGE_MAP ()
};

#endif
